{
    m_mac_debug_updater_aborted: {
        description: 'Fired when the Sparkle update framework aborts its update due to an error',
        owners: ['diegoreymendez', 'quanganhdo'],
        triggers: ['other'],
        suffixes: [],
        parameters: [
            'appVersion',
            'pixelSource',
            {
                key: 'd',
                description: 'The error domain, representing the type of error, e.g. SUSparkleErrorDomain',
                type: 'string',
            },
            {
                key: 'e',
                description: 'The error code representing the exact error, e.g. 4005',
                type: 'number',
            },
            {
                key: 'ud',
                description: 'The underlying error domain, representing the type of error, e.g. SUSparkleErrorDomain',
                type: 'string',
            },
            {
                key: 'ue',
                description: 'The underlying error code representing the exact error, e.g. 10',
                type: 'number',
            },
            {
                key: 'reason',
                description: 'The reason string provided by the Sparkle framework, e.g. "The update is improperly signed and could not be validated."',
                type: 'string',
                enum: [
                    'Package installer failed to launch.',
                    'Guided package installer failed to launch',
                    'Guided package installer returned non-zero exit status',
                    'Failed to perform installation because the paths to install at and from are not valid',
                    "Failed to recursively update new application's modification time before moving into temporary directory",
                    'Failed to perform installation because a path could not be constructed for the old installation',
                    'Failed to move the new app',
                    'Failed to perform installation because the last path component of the old installation URL could not be constructed.',
                    'The update is improperly signed and could not be validated.',
                    'Found regular application update',
                    'An error occurred while running the updater.',
                    'An error occurred while encoding the installer parameters.',
                    'An error occurred while starting the installer.',
                    'An error occurred while connecting to the installer.',
                    'An error occurred while launching the installer.',
                    'An error occurred while extracting the archive',
                    'An error occurred while downloading the update',
                    'An error occurred in retrieving update information',
                    'An error occurred while parsing the update feed',
                    'unknown',
                ],
            },
        ],
    },
}
